<?php

declare(strict_types=1);

return [
    /*
    |--------------------------------------------------------------------------
    | ID Тарифные планы в сделках аккаунте Админа амосрм
    |--------------------------------------------------------------------------
    |
    */
        'tariffs' => [
            '1231291' => 'тестовый период',
            '1231277' => 'базовый',
            '1231279' => 'расширенный',
            '1231281' => 'профессиональный',
            '1231283' => 'старт ап',
            '1231285' => 'микро бизнес',
            '1231287' => 'расширенный архивный',
            '1231289' => 'архивный',
            '1233767' => 'партнер',
            '1271575' => 'закончилась лицензия',
        ],

    /*
    |--------------------------------------------------------------------------
    | ID полей для создания нотификации об установке виджета
    |--------------------------------------------------------------------------
    |
    */
    'pipeline_id' => 970717,
    'status_id' => 37645075,
    'responsible_user_id' => 3762532,
    'tariff_id' => 608617,
    'account_id' => 606973,
    'user_count_id' => 608623,
    'paid_till_id' => 598055,

    /*
    |--------------------------------------------------------------------------
    | Данные управляюшего виджета
    |--------------------------------------------------------------------------
    |
    */
    'widget' => [
        'client_id' => env('DCT_AMOCRM_CLIENT_ID', '99d7c33b-1d67-477b-9614-844a2eb3bcd7'),
        'domain' => env('DCT_AMOCRM_CLIENT_DOMAIN', 'tech8.amocrm.ru'),
        'client_secret' => env(
            'DCT_AMOCRM_CLIENT_SECRET',
            'zb3ZSIQ5BxcKGqYeFf44O14t84IqHjRNxeTEUN8VRB8poIix3Jm3ZBDauRlNrbYm'
        ),
        'redirect_url' => env('DCT_AMOCRM_REDIRECT_URL', 'https://api.woochat.ru/api/amocrm/dct/auth/callback'),
        'account_delete' => env('DCT_AMOCRM_ACCOUNT_DELETE', 'https://api.woochat.ru/api/amocrm/widget/delete'),
    ],
];
